var all_data = {
    "detailed_data": {
        "数理科学部": {
            "数学": {
                "name": "数学",
                "受理项数": 187,
                "受理金额": 24310,
                "批准项数": 13,
                "批准金额": 1690
            },
            "力学": {
                "name": "力学",
                "受理项数": 131,
                "受理金额": 17030,
                "批准项数": 9,
                "批准金额": 1170
            },
            "天文学": {
                "name": "天文学",
                "受理项数": 62,
                "受理金额": 8060,
                "批准项数": 5,
                "批准金额": 650
            },
            "物理学I": {
                "name": "物理学I",
                "受理项数": 115,
                "受理金额": 14950,
                "批准项数": 12,
                "批准金额": 1560
            },
            "物理学II": {
                "name": "物理学II",
                "受理项数": 142,
                "受理金额": 18460,
                "批准项数": 8,
                "批准金额": 1040
            }
        },
        "化学科学部": {
            "合成化学": {
                "name": "合成化学",
                "受理项数": 117,
                "受理金额": 15210,
                "批准项数": 9,
                "批准金额": 1170
            },
            "催化与表界面化学": {
                "name": "催化与表界面化学",
                "受理项数": 45,
                "受理金额": 5850,
                "批准项数": 3,
                "批准金额": 390
            },
            "化学理论与机制": {
                "name": "化学理论与机制",
                "受理项数": 68,
                "受理金额": 8840,
                "批准项数": 5,
                "批准金额": 650
            },
            "化学测量学": {
                "name": "化学测量学",
                "受理项数": 112,
                "受理金额": 14560,
                "批准项数": 8,
                "批准金额": 1040
            },
            "材料化学与能源化学": {
                "name": "材料化学与能源化学",
                "受理项数": 112,
                "受理金额": 14560,
                "批准项数": 9,
                "批准金额": 1170
            },
            "环境化学": {
                "name": "环境化学",
                "受理项数": 103,
                "受理金额": 13390,
                "批准项数": 8,
                "批准金额": 1040
            },
            "化学生物学": {
                "name": "化学生物学",
                "受理项数": 60,
                "受理金额": 7800,
                "批准项数": 5,
                "批准金额": 650
            },
            "化学工程与工业化学": {
                "name": "化学工程与工业化学",
                "受理项数": 133,
                "受理金额": 17290,
                "批准项数": 10,
                "批准金额": 1300
            }
        },
        "生命科学部": {
            "微生物学、植物学": {
                "name": "微生物学、植物学",
                "受理项数": 102,
                "受理金额": 13260,
                "批准项数": 5,
                "批准金额": 650
            },
            "生态学、林学": {
                "name": "生态学、林学",
                "受理项数": 124,
                "受理金额": 16120,
                "批准项数": 6,
                "批准金额": 780
            },
            "生物物理、生化与生物分子学、生物力学与组织工程、免疫学": {
                "name": "生物物理、生化与生物分子学、生物力学与组织工程、免疫学",
                "受理项数": 111,
                "受理金额": 14430,
                "批准项数": 11,
                "批准金额": 1430
            },
            "神经、认识与心理学、生理学与整合生物学": {
                "name": "神经、认识与心理学、生理学与整合生物学",
                "受理项数": 69,
                "受理金额": 8970,
                "批准项数": 5,
                "批准金额": 650
            },
            "遗传学与生物信息学、细胞生物学、发育生物学与生殖生物学": {
                "name": "遗传学与生物信息学、细胞生物学、发育生物学与生殖生物学",
                "受理项数": 101,
                "受理金额": 13130,
                "批准项数": 8,
                "批准金额": 1040
            },
            "食品科学、农学基础与作物学": {
                "name": "食品科学、农学基础与作物学",
                "受理项数": 84,
                "受理金额": 10920,
                "批准项数": 5,
                "批准金额": 650
            },
            "植物保护学、园艺学与植物营养学": {
                "name": "植物保护学、园艺学与植物营养学",
                "受理项数": 61,
                "受理金额": 7930,
                "批准项数": 7,
                "批准金额": 910
            },
            "动物学、畜牧学与草地科学、兽医学、水产学": {
                "name": "动物学、畜牧学与草地科学、兽医学、水产学",
                "受理项数": 123,
                "受理金额": 15990,
                "批准项数": 11,
                "批准金额": 1430
            }
        },
        "地球科学部": {
            "地理学": {
                "name": "地理学",
                "受理项数": 111,
                "受理金额": 14430,
                "批准项数": 6,
                "批准金额": 780
            },
            "地质学": {
                "name": "地质学",
                "受理项数": 88,
                "受理金额": 11440,
                "批准项数": 6,
                "批准金额": 780
            },
            "地球化学": {
                "name": "地球化学",
                "受理项数": 21,
                "受理金额": 2730,
                "批准项数": 4,
                "批准金额": 520
            },
            "地球物理学和空间物理学": {
                "name": "地球物理学和空间物理学",
                "受理项数": 69,
                "受理金额": 8970,
                "批准项数": 5,
                "批准金额": 650
            },
            "大气科学学科": {
                "name": "大气科学学科",
                "受理项数": 52,
                "受理金额": 6760,
                "批准项数": 5,
                "批准金额": 650
            },
            "海洋科学": {
                "name": "海洋科学",
                "受理项数": 63,
                "受理金额": 8190,
                "批准项数": 5,
                "批准金额": 650
            },
            "环境地球科学和土壤学": {
                "name": "环境地球科学和土壤学",
                "受理项数": 154,
                "受理金额": 20020,
                "批准项数": 9,
                "批准金额": 1170
            }
        },
        "工程与材料科学部": {
            "金属材料学科": {
                "name": "金属材料学科",
                "受理项数": 94,
                "受理金额": 12220,
                "批准项数": 7,
                "批准金额": 910
            },
            "无机非金属材料学科": {
                "name": "无机非金属材料学科",
                "受理项数": 138,
                "受理金额": 17940,
                "批准项数": 11,
                "批准金额": 1430
            },
            "有机高分子材料学科": {
                "name": "有机高分子材料学科",
                "受理项数": 102,
                "受理金额": 13260,
                "批准项数": 8,
                "批准金额": 1040
            },
            "冶金与矿业学科": {
                "name": "冶金与矿业学科",
                "受理项数": 106,
                "受理金额": 13780,
                "批准项数": 7,
                "批准金额": 910
            },
            "机械工程学科": {
                "name": "机械工程学科",
                "受理项数": 120,
                "受理金额": 15600,
                "批准项数": 9,
                "批准金额": 1170
            },
            "工程热物理与能源利用学科": {
                "name": "工程热物理与能源利用学科",
                "受理项数": 89,
                "受理金额": 11570,
                "批准项数": 6,
                "批准金额": 780
            },
            "电气科学与工程学科": {
                "name": "电气科学与工程学科",
                "受理项数": 77,
                "受理金额": 10010,
                "批准项数": 6,
                "批准金额": 780
            },
            "建筑环境与结构工程学科": {
                "name": "建筑环境与结构工程学科",
                "受理项数": 162,
                "受理金额": 21060,
                "批准项数": 12,
                "批准金额": 1560
            },
            "水利科学与海洋工程学科": {
                "name": "水利科学与海洋工程学科",
                "受理项数": 125,
                "受理金额": 16250,
                "批准项数": 8,
                "批准金额": 1040
            }
        },
        "信息科学部": {
            "电子学与信息系统": {
                "name": "电子学与信息系统",
                "受理项数": 245,
                "受理金额": 31850,
                "批准项数": 15,
                "批准金额": 1950
            },
            "计算机科学学科": {
                "name": "计算机科学学科",
                "受理项数": 122,
                "受理金额": 15860,
                "批准项数": 10,
                "批准金额": 1300
            },
            "自动化学科": {
                "name": "自动化学科",
                "受理项数": 249,
                "受理金额": 32370,
                "批准项数": 17,
                "批准金额": 2210
            },
            "半导体科学、光学和光电子学": {
                "name": "半导体科学、光学和光电子学",
                "受理项数": 253,
                "受理金额": 32890,
                "批准项数": 18,
                "批准金额": 2340
            }
        },
        "管理科学部": {
            "管理综合处": {
                "name": "管理综合处",
                "受理项数": 189,
                "受理金额": 24570,
                "批准项数": 14,
                "批准金额": 1820
            }
        },
        "医学科学部": {
            "医学一处": {
                "name": "医学一处",
                "受理项数": 58,
                "受理金额": 7540,
                "批准项数": 5,
                "批准金额": 650
            },
            "医学二处": {
                "name": "医学二处",
                "受理项数": 85,
                "受理金额": 11050,
                "批准项数": 7,
                "批准金额": 910
            },
            "医学三处": {
                "name": "医学三处",
                "受理项数": 53,
                "受理金额": 6890,
                "批准项数": 6,
                "批准金额": 780
            },
            "医学四处": {
                "name": "医学四处",
                "受理项数": 35,
                "受理金额": 4550,
                "批准项数": 3,
                "批准金额": 390
            },
            "医学五处": {
                "name": "医学五处",
                "受理项数": 67,
                "受理金额": 8710,
                "批准项数": 5,
                "批准金额": 650
            },
            "医学六处": {
                "name": "医学六处",
                "受理项数": 51,
                "受理金额": 6630,
                "批准项数": 4,
                "批准金额": 520
            },
            "医学七处": {
                "name": "医学七处",
                "受理项数": 101,
                "受理金额": 13130,
                "批准项数": 7,
                "批准金额": 910
            },
            "医学八处": {
                "name": "医学八处",
                "受理项数": 37,
                "受理金额": 4810,
                "批准项数": 3,
                "批准金额": 390
            },
            "医学九处": {
                "name": "医学九处",
                "受理项数": 82,
                "受理金额": 10660,
                "批准项数": 5,
                "批准金额": 650
            },
            "医学十处": {
                "name": "医学十处",
                "受理项数": 61,
                "受理金额": 7930,
                "批准项数": 5,
                "批准金额": 650
            }
        }
    },
    "corr_data": {
        "数理科学部": {
            "name": "数理科学部",
            "合计项数": 47,
            "合计金额": 6110,
            "教育部项数": 22,
            "教育部金额": 2860,
            "中国科学院项数": 12,
            "中国科学院金额": 1560,
            "工交农医国防等项数": 5,
            "工交农医国防等金额": 650,
            "各省项数": 8,
            "各省金额": 1040
        },
        "化学科学部": {
            "name": "化学科学部",
            "合计项数": 57,
            "合计金额": 7410,
            "教育部项数": 39,
            "教育部金额": 5070,
            "中国科学院项数": 11,
            "中国科学院金额": 1430,
            "工交农医国防等项数": 2,
            "工交农医国防等金额": 260,
            "各省项数": 5,
            "各省金额": 650
        },
        "生命科学部": {
            "name": "生命科学部",
            "合计项数": 58,
            "合计金额": 7540,
            "教育部项数": 31,
            "教育部金额": 4030,
            "中国科学院项数": 12,
            "中国科学院金额": 1560,
            "工交农医国防等项数": 5,
            "工交农医国防等金额": 650,
            "各省项数": 10,
            "各省金额": 1300
        },
        "地球科学部": {
            "name": "地球科学部",
            "合计项数": 40,
            "合计金额": 5200,
            "教育部项数": 15,
            "教育部金额": 1950,
            "中国科学院项数": 17,
            "中国科学院金额": 2210,
            "工交农医国防等项数": 5,
            "工交农医国防等金额": 650,
            "各省项数": 3,
            "各省金额": 390
        },
        "工程与材料科学部": {
            "name": "工程与材料科学部",
            "合计项数": 74,
            "合计金额": 9620,
            "教育部项数": 47,
            "教育部金额": 6110,
            "中国科学院项数": 10,
            "中国科学院金额": 1300,
            "工交农医国防等项数": 15,
            "工交农医国防等金额": 1950,
            "各省项数": 2,
            "各省金额": 260
        },
        "信息科学部": {
            "name": "信息科学部",
            "合计项数": 60,
            "合计金额": 7800,
            "教育部项数": 28,
            "教育部金额": 3640,
            "中国科学院项数": 8,
            "中国科学院金额": 1040,
            "工交农医国防等项数": 11,
            "工交农医国防等金额": 1430,
            "各省项数": 13,
            "各省金额": 1690
        },
        "管理科学部": {
            "name": "管理科学部",
            "合计项数": 14,
            "合计金额": 1820,
            "教育部项数": 11,
            "教育部金额": 1430,
            "中国科学院项数": 0,
            "中国科学院金额": 0,
            "工交农医国防等项数": 3,
            "工交农医国防等金额": 390,
            "各省项数": 0,
            "各省金额": 0
        },
        "医学科学部": {
            "name": "医学科学部",
            "合计项数": 50,
            "合计金额": 6500,
            "教育部项数": 29,
            "教育部金额": 3770,
            "中国科学院项数": 5,
            "中国科学院金额": 650,
            "工交农医国防等项数": 9,
            "工交农医国防等金额": 1170,
            "各省项数": 7,
            "各省金额": 910
        }
    },
    "prop_data": {
        "数理科学部": {
            "name": "数理科学部",
            "合计项数": 47,
            "合计金额": 6110,
            "高等院校项数": 39,
            "高等院校金额": 5070,
            "科研单位项数": 8,
            "科研单位金额": 1040,
            "其他项数": 0,
            "其他金额": 0
        },
        "化学科学部": {
            "name": "化学科学部",
            "合计项数": 57,
            "合计金额": 7410,
            "高等院校项数": 47,
            "高等院校金额": 6110,
            "科研单位项数": 10,
            "科研单位金额": 1300,
            "其他项数": 0,
            "其他金额": 0
        },
        "生命科学部": {
            "name": "生命科学部",
            "合计项数": 58,
            "合计金额": 7540,
            "高等院校项数": 40,
            "高等院校金额": 5200,
            "科研单位项数": 18,
            "科研单位金额": 2340,
            "其他项数": 0,
            "其他金额": 0
        },
        "地球科学部": {
            "name": "地球科学部",
            "合计项数": 40,
            "合计金额": 5200,
            "高等院校项数": 24,
            "高等院校金额": 3120,
            "科研单位项数": 16,
            "科研单位金额": 2080,
            "其他项数": 0,
            "其他金额": 0
        },
        "工程与材料科学部": {
            "name": "工程与材料科学部",
            "合计项数": 74,
            "合计金额": 9620,
            "高等院校项数": 61,
            "高等院校金额": 7930,
            "科研单位项数": 13,
            "科研单位金额": 1690,
            "其他项数": 0,
            "其他金额": 0
        },
        "信息科学部": {
            "name": "信息科学部",
            "合计项数": 60,
            "合计金额": 7800,
            "高等院校项数": 55,
            "高等院校金额": 7150,
            "科研单位项数": 5,
            "科研单位金额": 650,
            "其他项数": 0,
            "其他金额": 0
        },
        "管理科学部": {
            "name": "管理科学部",
            "合计项数": 14,
            "合计金额": 1820,
            "高等院校项数": 14,
            "高等院校金额": 1820,
            "科研单位项数": 0,
            "科研单位金额": 0,
            "其他项数": 0,
            "其他金额": 0
        },
        "医学科学部": {
            "name": "医学科学部",
            "合计项数": 50,
            "合计金额": 6500,
            "高等院校项数": 39,
            "高等院校金额": 5070,
            "科研单位项数": 10,
            "科研单位金额": 1300,
            "其他项数": 1,
            "其他金额": 130
        }
    },
    "loc_data": {
        "北京": {
            "地区": "北京",
            "合计项数": 130,
            "合计金额": 16900,
            "数理科学部项数": 17.0,
            "数理科学部金额": 2210.0,
            "化学科学部项数": 18.0,
            "化学科学部金额": 2340.0,
            "生命科学部项数": 18.0,
            "生命科学部金额": 2340.0,
            "地球科学部项数": 16.0,
            "地球科学部金额": 2080.0,
            "工程与材料学部项数": 25.0,
            "工程与材料学部金额": 3250.0,
            "信息科学部项数": 21.0,
            "信息科学部金额": 2730.0,
            "管理科学部项数": 6.0,
            "管理科学部金额": 780.0,
            "医学科学部项数": 9.0,
            "医学科学部金额": 1170.0
        },
        "上海": {
            "地区": "上海",
            "合计项数": 49,
            "合计金额": 6370,
            "数理科学部项数": 4.0,
            "数理科学部金额": 520.0,
            "化学科学部项数": 8.0,
            "化学科学部金额": 1040.0,
            "生命科学部项数": 8.0,
            "生命科学部金额": 1040.0,
            "地球科学部项数": 1.0,
            "地球科学部金额": 130.0,
            "工程与材料学部项数": 5.0,
            "工程与材料学部金额": 650.0,
            "信息科学部项数": 8.0,
            "信息科学部金额": 1040.0,
            "管理科学部项数": 1.0,
            "管理科学部金额": 130.0,
            "医学科学部项数": 14.0,
            "医学科学部金额": 1820.0
        },
        "江苏": {
            "地区": "江苏",
            "合计项数": 34,
            "合计金额": 4420,
            "数理科学部项数": 6.0,
            "数理科学部金额": 780.0,
            "化学科学部项数": 5.0,
            "化学科学部金额": 650.0,
            "生命科学部项数": 6.0,
            "生命科学部金额": 780.0,
            "地球科学部项数": 3.0,
            "地球科学部金额": 390.0,
            "工程与材料学部项数": 4.0,
            "工程与材料学部金额": 520.0,
            "信息科学部项数": 5.0,
            "信息科学部金额": 650.0,
            "管理科学部项数": 2.0,
            "管理科学部金额": 260.0,
            "医学科学部项数": 3.0,
            "医学科学部金额": 390.0
        },
        "广东": {
            "地区": "广东",
            "合计项数": 29,
            "合计金额": 3770,
            "数理科学部项数": 3.0,
            "数理科学部金额": 390.0,
            "化学科学部项数": 6.0,
            "化学科学部金额": 780.0,
            "生命科学部项数": 5.0,
            "生命科学部金额": 650.0,
            "地球科学部项数": 1.0,
            "地球科学部金额": 130.0,
            "工程与材料学部项数": 4.0,
            "工程与材料学部金额": 520.0,
            "信息科学部项数": 2.0,
            "信息科学部金额": 260.0,
            "管理科学部项数": 2.0,
            "管理科学部金额": 260.0,
            "医学科学部项数": 6.0,
            "医学科学部金额": 780.0
        },
        "湖北": {
            "地区": "湖北",
            "合计项数": 22,
            "合计金额": 2860,
            "数理科学部项数": 3.0,
            "数理科学部金额": 390.0,
            "化学科学部项数": 3.0,
            "化学科学部金额": 390.0,
            "生命科学部项数": 5.0,
            "生命科学部金额": 650.0,
            "地球科学部项数": 2.0,
            "地球科学部金额": 260.0,
            "工程与材料学部项数": 3.0,
            "工程与材料学部金额": 390.0,
            "信息科学部项数": 2.0,
            "信息科学部金额": 260.0,
            "管理科学部项数": 1.0,
            "管理科学部金额": 130.0,
            "医学科学部项数": 3.0,
            "医学科学部金额": 390.0
        },
        "安徽": {
            "地区": "安徽",
            "合计项数": 18,
            "合计金额": 2340,
            "数理科学部项数": 5.0,
            "数理科学部金额": 650.0,
            "化学科学部项数": 1.0,
            "化学科学部金额": 130.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 5.0,
            "地球科学部金额": 650.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 5.0,
            "信息科学部金额": 650.0,
            "管理科学部项数": 1.0,
            "管理科学部金额": 130.0,
            "医学科学部项数": 1.0,
            "医学科学部金额": 130.0
        },
        "浙江": {
            "地区": "浙江",
            "合计项数": 18,
            "合计金额": 2340,
            "数理科学部项数": 2.0,
            "数理科学部金额": 260.0,
            "化学科学部项数": 2.0,
            "化学科学部金额": 260.0,
            "生命科学部项数": 5.0,
            "生命科学部金额": 650.0,
            "地球科学部项数": 1.0,
            "地球科学部金额": 130.0,
            "工程与材料学部项数": 3.0,
            "工程与材料学部金额": 390.0,
            "信息科学部项数": 3.0,
            "信息科学部金额": 390.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 2.0,
            "医学科学部金额": 260.0
        },
        "四川": {
            "地区": "四川",
            "合计项数": 15,
            "合计金额": 1950,
            "数理科学部项数": 2.0,
            "数理科学部金额": 260.0,
            "化学科学部项数": 1.0,
            "化学科学部金额": 130.0,
            "生命科学部项数": 1.0,
            "生命科学部金额": 130.0,
            "地球科学部项数": 2.0,
            "地球科学部金额": 260.0,
            "工程与材料学部项数": 4.0,
            "工程与材料学部金额": 520.0,
            "信息科学部项数": 2.0,
            "信息科学部金额": 260.0,
            "管理科学部项数": 1.0,
            "管理科学部金额": 130.0,
            "医学科学部项数": 2.0,
            "医学科学部金额": 260.0
        },
        "山东": {
            "地区": "山东",
            "合计项数": 11,
            "合计金额": 1430,
            "数理科学部项数": 1.0,
            "数理科学部金额": 130.0,
            "化学科学部项数": 1.0,
            "化学科学部金额": 130.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 3.0,
            "地球科学部金额": 390.0,
            "工程与材料学部项数": 3.0,
            "工程与材料学部金额": 390.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 2.0,
            "医学科学部金额": 260.0
        },
        "福建": {
            "地区": "福建",
            "合计项数": 10,
            "合计金额": 1300,
            "数理科学部项数": 1.0,
            "数理科学部金额": 130.0,
            "化学科学部项数": 2.0,
            "化学科学部金额": 260.0,
            "生命科学部项数": 3.0,
            "生命科学部金额": 390.0,
            "地球科学部项数": 1.0,
            "地球科学部金额": 130.0,
            "工程与材料学部项数": 1.0,
            "工程与材料学部金额": 130.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 1.0,
            "医学科学部金额": 130.0
        },
        "黑龙江": {
            "地区": "黑龙江",
            "合计项数": 10,
            "合计金额": 1300,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 1.0,
            "生命科学部金额": 130.0,
            "地球科学部项数": 1.0,
            "地球科学部金额": 130.0,
            "工程与材料学部项数": 5.0,
            "工程与材料学部金额": 650.0,
            "信息科学部项数": 3.0,
            "信息科学部金额": 390.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "重庆": {
            "地区": "重庆",
            "合计项数": 9,
            "合计金额": 1170,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 3.0,
            "化学科学部金额": 390.0,
            "生命科学部项数": 2.0,
            "生命科学部金额": 260.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 2.0,
            "工程与材料学部金额": 260.0,
            "信息科学部项数": 0.0,
            "信息科学部金额": 0.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 2.0,
            "医学科学部金额": 260.0
        },
        "湖南": {
            "地区": "湖南",
            "合计项数": 8,
            "合计金额": 1040,
            "数理科学部项数": 2.0,
            "数理科学部金额": 260.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 5.0,
            "工程与材料学部金额": 650.0,
            "信息科学部项数": 0.0,
            "信息科学部金额": 0.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 1.0,
            "医学科学部金额": 130.0
        },
        "吉林": {
            "地区": "吉林",
            "合计项数": 7,
            "合计金额": 910,
            "数理科学部项数": 1.0,
            "数理科学部金额": 130.0,
            "化学科学部项数": 2.0,
            "化学科学部金额": 260.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 2.0,
            "工程与材料学部金额": 260.0,
            "信息科学部项数": 2.0,
            "信息科学部金额": 260.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "辽宁": {
            "地区": "辽宁",
            "合计项数": 7,
            "合计金额": 910,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 2.0,
            "化学科学部金额": 260.0,
            "生命科学部项数": 1.0,
            "生命科学部金额": 130.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 3.0,
            "工程与材料学部金额": 390.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "天津": {
            "地区": "天津",
            "合计项数": 6,
            "合计金额": 780,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 1.0,
            "化学科学部金额": 130.0,
            "生命科学部项数": 1.0,
            "生命科学部金额": 130.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 3.0,
            "工程与材料学部金额": 390.0,
            "信息科学部项数": 0.0,
            "信息科学部金额": 0.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 1.0,
            "医学科学部金额": 130.0
        },
        "陕西": {
            "地区": "陕西",
            "合计项数": 6,
            "合计金额": 780,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 1.0,
            "生命科学部金额": 130.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 2.0,
            "工程与材料学部金额": 260.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 2.0,
            "医学科学部金额": 260.0
        },
        "甘肃": {
            "地区": "甘肃",
            "合计项数": 4,
            "合计金额": 520,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 1.0,
            "化学科学部金额": 130.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 3.0,
            "地球科学部金额": 390.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 0.0,
            "信息科学部金额": 0.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "河南": {
            "地区": "河南",
            "合计项数": 2,
            "合计金额": 260,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 1.0,
            "医学科学部金额": 130.0
        },
        "山西": {
            "地区": "山西",
            "合计项数": 2,
            "合计金额": 260,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 1.0,
            "化学科学部金额": 130.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "江西": {
            "地区": "江西",
            "合计项数": 1,
            "合计金额": 130,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 1.0,
            "信息科学部金额": 130.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "贵州": {
            "地区": "贵州",
            "合计项数": 1,
            "合计金额": 130,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 0.0,
            "生命科学部金额": 0.0,
            "地球科学部项数": 1.0,
            "地球科学部金额": 130.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 0.0,
            "信息科学部金额": 0.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        },
        "云南": {
            "地区": "云南",
            "合计项数": 1,
            "合计金额": 130,
            "数理科学部项数": 0.0,
            "数理科学部金额": 0.0,
            "化学科学部项数": 0.0,
            "化学科学部金额": 0.0,
            "生命科学部项数": 1.0,
            "生命科学部金额": 130.0,
            "地球科学部项数": 0.0,
            "地球科学部金额": 0.0,
            "工程与材料学部项数": 0.0,
            "工程与材料学部金额": 0.0,
            "信息科学部项数": 0.0,
            "信息科学部金额": 0.0,
            "管理科学部项数": 0.0,
            "管理科学部金额": 0.0,
            "医学科学部项数": 0.0,
            "医学科学部金额": 0.0
        }
    }
}

var all_keys = ['数理科学部', '化学科学部', '生命科学部', '地球科学部',
    '工程与材料科学部', '信息科学部', '管理科学部', '医学科学部'];
var all_modals = [];
var curr_key;

function handleDetailData() {
    console.log('detail_data')
}

function handleCorrData() {
    console.log('corr_data');
}

function handlePropData() {
    console.log('prop_data');
}

function handleLocData() {
    console.log('loc_data');
}

function handleclick(key_i) {
    // 获取弹窗
    console.log(key_i);
    var key = all_keys[Math.floor(key_i / 2)];
    curr_key = key
    var modal = document.getElementById('DetailData-Modal');
    modal.style.display = 'block';
    d3.select("#DetailData-Modal" + key).style("display", "block");
}

function initializeDetailData() {
    var upper = 120;
    var bottom = 100;
    var left = 200;
    var color = ['#5DC0E1', '#5DE180']
    var alignment = 80
    var width = 1200;  //画布的宽度
    var height = 800;   //画布的高度
    var rectHeight = 50;   //每个矩形所占的像素高度(包括空白)

    var detailed_data_all = [];
    var detailed_data_pass = [];
    for (key in all_data['detailed_data']) {
        item = all_data['detailed_data'][key];
        var sum_all = 0;
        var sum_pass = 0;
        for (key2 in item) {
            sum_all += item[key2]['受理项数'];
            sum_pass += item[key2]['批准项数'];
        }
        detailed_data_all.push(sum_all);
        detailed_data_pass.push(sum_pass);
    }
    console.log(detailed_data_all);
    console.log(detailed_data_pass);
    var detailed_data_mixed = [];
    for (let i = 0; i < detailed_data_all.length; ++i) {
        detailed_data_mixed.push(detailed_data_all[i]);
        detailed_data_mixed.push(detailed_data_pass[i]);
    }
    console.log(detailed_data_mixed);
    var min = d3.min(detailed_data_mixed);
    var max = d3.max(detailed_data_mixed);
    var yScale = d3.scaleLinear()
        .domain([min, max])
        .range([height - upper - bottom, 0]);

    var linear_all = d3.scaleLinear()
        .domain([0, max])
        .range([0, height - upper - bottom]);
    // var linear_pass = d3.scaleLinear()
    //     .domain([d3.min(detailed_data_pass), d3.max(detailed_data_pass)])
    //     .range([10, 100])
    var linear_pass = linear_all;
    var yAxis = d3.axisLeft(yScale);
    let blank_tmp = alignment / 2;
    let x = d3.scaleOrdinal().range([0
        , 1 * rectHeight - 10 + blank_tmp
        , 3 * rectHeight - 10 + blank_tmp
        , 5 * rectHeight - 10 + blank_tmp
        , 7 * rectHeight - 10 + blank_tmp
        , 9 * rectHeight - 10 + blank_tmp
        , 11 * rectHeight - 10 + blank_tmp
        , 13 * rectHeight - 10 + blank_tmp
        , 15 * rectHeight - 10 + blank_tmp]);
    let xScale = x.domain(['', '数理科学部', '化学科学部', '生命科学部', '地球科学部',
        '工程与材料科学部', '信息科学部', '管理科学部', '医学科学部'])

    var xAxis = d3.axisBottom(xScale);

    var svg = d3.select("body")     //选择文档中的body元素
        .append("svg")          //添加一个svg元素
        .attr("width", width)       //设定宽度
        .attr("height", height)    //设定高度
        .attr("style", "text-align:center; display: block")
        .attr("id", "svg-DetailData-main");

    svg.selectAll("myrect")
        .data(detailed_data_mixed)
        .enter()
        .append("rect")
        .attr("x", function (d, i) {
            return left + alignment + ((i % 2 == 0) ? i * rectHeight : (i * rectHeight - 10));
        })
        .attr("y", function (d, i) {
            return height - ((i % 2 == 0) ? linear_all(d) : linear_pass(d)) - bottom;
        })
        .attr("width", rectHeight - 10)
        .attr("height", function (d, i) {
            return (i % 2 == 0) ? linear_all(d) : linear_pass(d);
        })
        .attr("fill", function (d, i) {
            return color[i % 2];
        })
        .attr("class", "svg-DetailData-main")
        .attr("onclick", function (d, i) {
            return "handleclick(" + i + ")";
        });
    svg.selectAll("myrect")
        .data(detailed_data_mixed)
        .enter()
        .append("text")
        .attr("class", "mytext")
        .attr("transform", "translate(" + (left + alignment) + "," + upper + ")")
        .attr("x", function (d, i) {
            let tmp = 0;
            if (d >= 1000) tmp = 0;
            else if (d >= 100) tmp = 5;
            else tmp = 10;
            return ((i % 2 == 0) ? i * rectHeight : (i * rectHeight - 10)) + tmp;
        })
        .attr("y", function (d) {
            let tmp = 0;
            if (d < 100) tmp = 5;
            return yScale(d) - 10 - tmp;
        })
        .attr("alignment-baseline", "middle")
        .text(function (d) {
            return d;
        });
    svg.append("g")
        .attr("class", "Yaxis")
        .attr("transform", "translate(" + (left + alignment / 2) + "," + upper + " )")
        .call(yAxis);
    svg.append("g")
        .attr("class", "Xaxis")
        .attr("transform", "translate(" + (left + alignment / 2) + "," + (height - bottom) + " )")
        .call(xAxis)
        .style("font-size", "10px");
    svg.append("rect")
        .attr("x", 800 + left)
        .attr("y", 20)
        .attr("width", 60)
        .attr("height", 20)
        .style("fill", color[0]);
    svg.append("rect")
        .attr("x", 800 + left)
        .attr("y", 50)
        .attr("width", 60)
        .attr("height", 20)
        .style("fill", color[1]);
    svg.append("text")
        .attr("x", 880 + left)
        .attr("y", 30)
        .text("全部申请")
        .style("font-size", "15px")
        .attr("alignment-baseline", "middle")
    svg.append("text")
        .attr("x", 880 + left)
        .attr("y", 60).text("已批准申请")
        .style("font-size", "15px")
        .attr("alignment-baseline", "middle")
    svg.append("text")
        .attr("x", 20 + left).attr("y", 100)
        .text("项数(个)")
        .style("font-size", "15px")
        .attr("alignment-baseline", "middle")
    svg.append("text")
        .attr("x", 20 + left + 5 * rectHeight).attr("y", 20)
        .text("点击矩形可以获得详细信息")
        .style("font-size", "30px")
        .attr("alignment-baseline", "middle")
    for (key in all_data['detailed_data']) {
        var local_settings = {
            upper: 50,
            bottom: 50,
            left: 50,
            right: 50,
        }
        var rect_settings = {
            width: 24,
            space: 4,
        }
        var item = all_data['detailed_data'][key];
        console.log(d3.selectAll("#DetailData-Modal"))
        var modal_svg = d3.select("#DetailData-Modal").select("div")
            .append("svg")          //添加一个svg元素
            .attr("width", 550)       //设定宽度
            .attr("height", 550)    //设定高度
            .attr("style", "text-align: center; display: none")
            .attr("id", "DetailData-Modal" + key);
        var modal_all = [];
        var modal_pass = [];
        var modal_mixed = [];
        for (key2 in item) {
            modal_all.push(item[key2]['受理项数']);
            modal_mixed.push(item[key2]['受理项数']);
            modal_pass.push(item[key2]['批准项数']);
            modal_mixed.push(item[key2]['批准项数']);
        }
        console.log(modal_all);
        console.log(modal_pass);
        console.log(modal_mixed);
        rect_settings['min'] = d3.min(modal_mixed);
        rect_settings['max'] = d3.max(modal_mixed);
        rect_settings['left-margin'] = (550 - rect_settings['width'] * modal_mixed.length) / 2
        rect_settings['scale_func'] = d3.scaleLinear()
            .domain([0, rect_settings['max']])
            .range([0, 550 - local_settings['upper'] - local_settings['bottom']]);
        modal_svg.append("text")
            .attr("x", 10)
            .attr("y", 10)
            .text("\"" + key + "\"" + "资金明细")
            .style("font-size", "15px")
            .attr("alignment-baseline", "middle")
        modal_svg.selectAll("myrect" + key)
            .data(modal_mixed)
            .enter()
            .append("rect")
            .attr("x", function (d, i) {
                return (rect_settings['left-margin'] +
                    ((i % 2 == 0) ?
                        (i * rect_settings['width'] - rect_settings['space'])
                        : (i * rect_settings['width'] - 2 * rect_settings['space'])));
            })
            .attr("y", function (d, i) {
                return 550 - rect_settings['scale_func'](d) - local_settings['bottom'];
            })
            .attr("width", rect_settings['width'] - rect_settings['space'])
            .attr("height", function (d, i) {
                return rect_settings['scale_func'](d);
            })
            .attr("fill", function (d, i) {
                return color[i % 2];
            })
            .attr("class", "svg-DetailData-main" + key);
    }
}

function initializeData() {

    initializeDetailData();
}
